import { Typography } from '@mui/material'
import { Layout } from '../components'

const TermsOfUse = () => (
  <Layout>
    <Typography fontSize={18} fontWeight='bold' textTransform='uppercase'>
      Пользовательское соглашение. Условия использования
    </Typography>
    <Typography fontWeight='bold' textTransform='uppercase'>
      1. Общие положения
    </Typography>
    <ul>
      <li>
        1.1. Принимая во внимание, что Connect представляет собой общее пространство взаимодействия пользователей, и
        инструментов призванных повысить удобство использования привычных для пользователей Сервиса Connect, далее
        именуемое также «Компания», «социальная сеть», «мы», «наше» или «нас», разработало и разместило настоящее
        Пользовательское соглашение (далее — настоящее Соглашение), которое применяется ко всем лицам, использующим
        Connect.
      </li>
      <li>
        1.2. Настоящее Соглашение может быть изменено и/или дополнено Компанией в одностороннем порядке. Настоящее
        Соглашение является открытым и общедоступным документом. Действующая редакция настоящего Соглашения размещена на
        сайте Connect. Компания рекомендует Пользователям регулярно проверять условия настоящего Соглашения на предмет
        его изменения и/или дополнения. Продолжение использования сервиса Connect Пользователем после внесения изменений
        и/или дополнений в настоящее Соглашение означает принятие и согласие Пользователя с такими изменениями и/или
        дополнениями.
      </li>
    </ul>
    <Typography fontWeight='bold' textTransform='uppercase'>
      2. Предмет Соглашения
    </Typography>
    <ul>
      <li>
        2.1. По условиям настоящего Соглашения Компания на безвозмездной основе предоставляет Пользователю следующие
        доступы, возможности и преимущества:
      </li>
      <ul>
        <li>
          2.1.1. Безопасное управление регистрационными данными через личный кабинет/ аккаунт Пользователя Connect;
        </li>
      </ul>
      <li>
        2.2. Использование сервиса Connect, как существующего на данный момент, так и того, который появится в будущем,
        условия использования которого ссылаются на настоящее Соглашение, означает в соответствии со ст. 438
        Гражданского кодекса Российской Федерации принятие Пользователем условий настоящего Соглашения в полном объёме,
        без каких-либо оговорок и исключений. Использование сервиса Connect, как существующего на данный момент, так и
        того, который будет создан в будущем, означает также принятие Пользователем условий отдельных пользовательских
        соглашений сервиса Connect и их политики конфиденциальности (ранее и далее — Пользовательская документация
        Сервиса), являющихся неотъемлемой частью настоящего Соглашения, в полном объёме, без каких-либо оговорок и
        исключений.
      </li>
    </ul>
    <Typography fontWeight='bold' textTransform='uppercase'>
      3. Создание аккаунта в Connect
    </Typography>
    <ul>
      <li>3.1. Для предоставления функциональных возможностей Connect Пользователю создается аккаунт в Connect.</li>
      <li>3.2. Такой аккаунт создается при регистрации на сайте Connect.</li>
      <li>
        3.3. Создание аккаунта в Connect является бесплатным и осуществляется путём заполнения регистрационной формы на
        сайте в сети Интернет.
      </li>
      <li>
        3.4. Пользователем Connect является физическое лицо, зарегистрированное в соответствии с установленным настоящим
        Соглашением порядком, достигшее возраста, допустимого в соответствии с законодательством Российской Федерации
        для акцепта настоящего Соглашения, и обладающее соответствующими полномочиями.
      </li>
      <li>
        3.5. В случае самостоятельной регистрации, в процессе заполнения регистрационной формы Connect в соответствии с
        п. 3.2 на сайте в сети Интернет Пользователь указывает обязательные актуальные достоверные данные, минимально
        необходимые для регистрации в Connect, включая фамилию, имя, дату рождения, пол, номер мобильного телефона.
      </li>
      <li>
        3.6. Пользователь несёт ответственность за достоверность, актуальность, полноту и соответствие законодательству
        Российской Федерации информации, предоставленной при создании аккаунта и её чистоту от претензий третьих лиц.
        Компания не проверяет достоверность предоставленной Пользователями информации, за исключением случаев, когда
        такая проверка необходима в целях исполнения Компанией обязательств перед Пользователями Connect.
      </li>
      <li>
        3.7. В случае самостоятельной регистрации после предоставления необходимой для регистрации информации
        Пользователю необходимо пройти ряд удостоверительных процедур, а именно подтвердить регистрацию путем введения в
        соответствующую форму на сайте в сети Интернет кода, полученного Пользователем в виде SMS-сообщения /
        звонка-сброса / звонка от робота или push-уведомления от Компании на мобильный телефон Пользователя, номер
        которого предоставляется самим Пользователем. В случае верного последовательного выполнения всех регистрационных
        действий создаётся аккаунт в Connect.
      </li>
      <li>
        3.8. После успешного создания аккаунта Пользователя Компания принимает на себя права и обязанности перед
        Пользователем, указанные в настоящем Соглашении.
      </li>
      <li>
        3.9. В целях исполнения настоящего Соглашения, а также Пользовательской документации Connect, пользователем
        которых является Пользователь настоящего Соглашения, в том числе в целях развития инструмента Connect,
        оптимизации качества инструментов Connect, совершенствования доступной функциональности Connect с целью
        предоставления пользователям персонализированных функций, Пользователь соглашается и поручает Компании
        осуществить в полном соответствии с действующим законодательством Российской Федерации о персональных данных
        сбор, передачу и получение данных, в том числе необходимых для регистрации, и/или авторизации в конкретном
        Сервисе, и/или использования функциональных возможностей Connect, в том числе для создания и поддержания
        аккаунта в Connect, для последующих сбора, хранения, накопления, систематизации, извлечения, сопоставления,
        использования, наполнения таких данных Сервисами, а также на получение таких данных от Сервисов, осуществление
        сбора и обработки, результатов автоматизированной обработки таких данных, в том числе с применением различных
        моделей оценки информации в виде целочисленных и/или текстовых значений и идентификаторов, соответствующих
        заданным в запросах оценочным критериям для обработки данных Компанией и/или Сервисами.
      </li>
      <li>
        3.10. Обработка персональных данных Пользователя Connect осуществляется в соответствии с законодательством
        Российской Федерации. Компания принимает все необходимые меры для защиты персональных данных Пользователя от
        неправомерного доступа, изменения, раскрытия или уничтожения. Компания предоставляет доступ к персональным
        данным Пользователя только тем работникам, подрядчикам и агентам Компании, которым эта информация необходима для
        обеспечения функционирования Connect и предоставления Пользователю доступа к использованию Сервисов и их
        функциональности. Компания вправе использовать предоставленную Пользователем Connect информацию, в том числе
        персональные данные, а также передавать её третьим лицам в целях обеспечения соблюдения требований действующего
        законодательства Российской Федерации, защиты прав и интересов Пользователей Connect, Компании, третьих лиц (в
        том числе в целях выявления, проверки/расследования и/или пресечения противоправных действий). Раскрытие
        предоставленной Пользователем Connect информации может быть произведено лишь в соответствии с действующим
        законодательством Российской Федерации по требованию суда, правоохранительных органов, а равно в иных
        предусмотренных законодательством Российской Федерации случаях. Поскольку Компания осуществляет обработку
        персональных данных Пользователя Connect в целях исполнения настоящего Соглашения, в силу положений
        законодательства о персональных данных согласие Пользователя на обработку его персональных данных не требуется.
      </li>
      <li>
        3.11. Пользователь Connect не имеет права предоставлять доступ к своему аккаунту иным лицам, несёт полную
        ответственность за сохранность данных, необходимых для авторизации, самостоятельно выбирая способ их хранения.
        Пользователь на используемом им аппаратно-программном обеспечении может разрешить хранение данных для
        последующей автоматической авторизации в Connect.
      </li>
      <li>
        3.12. Если Пользователем не доказано обратное, любые действия, совершённые посредством его аккаунта в Connect,
        считаются совершёнными соответствующим Пользователем. В случае несанкционированного доступа к аккаунту
        Пользователь обязан незамедлительно сообщить об этом Компании в установленном порядке.
      </li>
    </ul>
    <Typography fontWeight='bold' textTransform='uppercase'>
      4. Права и обязанности Пользователя
    </Typography>
    <ul>
      <li>
        4.1. При использовании Сервиса Connect Пользователь обязан:
        <ul>
          <li>
            4.1.1. соблюдать положения действующего законодательства Российской Федерации, настоящего Соглашения и
            Пользовательской документации тех Сервисов, в которых он зарегистрирован;
          </li>
          <li>
            4.1.2. предоставлять при создании аккаунта достоверные, полные и актуальные данные, следить за их
            актуализацией;
          </li>
          <li>4.1.3. информировать Компанию о несанкционированном доступе к аккаунту в Connect;</li>
          <li>
            4.1.4. не предоставлять доступ другим лицам к своему аккаунту или к отдельной содержащейся в нем информации,
            в случае если это может привести к нарушению законодательства Российской Федерации, и/или настоящего
            Соглашения, и/или Пользовательской документации Сервисов;
          </li>
          <li>4.1.5. осуществлять резервное копирование важной для Пользователя информации, хранящейся в Connect.</li>
        </ul>
      </li>
      <li>
        4.2. Пользователю Connect запрещается:
        <ul>
          <li>
            4.2.1. создавать аккаунт в качестве Пользователя от имени или вместо другого лица («фальшивый аккаунт»);
          </li>
          <li>4.2.2. искажать сведения о себе;</li>
          <li>
            4.2.3. использовать программное обеспечение и осуществлять действия, направленные на нарушение нормального
            функционирования Connect;
          </li>
          <li>
            4.2.4. загружать, хранить, публиковать, распространять и предоставлять доступ или иным образом использовать
            вирусы, трояны и другие вредоносные программы;
          </li>
          <li>
            4.2.5. любым способом, в том числе, но не ограничиваясь, путём обмана, злоупотребления доверием, взлома,
            пытаться получить доступ к аккаунту другого Пользователя.
          </li>
        </ul>
      </li>
      <li>
        4.3. Пользователь Connect имеет право:
        <ul>
          <li>
            4.3.1. Самостоятельно удалить аккаунт в Connect с использованием функциональной возможности «удалить
            аккаунт».
          </li>
        </ul>
      </li>
      <li>
        4.4. В случае несогласия Пользователя с настоящим Соглашением, его изменениями и дополнениями, Пользователь
        обязан отказаться от использования Сервисов Connect, проинформировав об этом Компанию в установленном порядке.
      </li>
    </ul>
    <Typography fontWeight='bold' textTransform='uppercase'>
      5. Права и обязанности Connect
    </Typography>
    <ul>
      <li>
        5.1. Компания осуществляет текущее управление и развитие Connect, разрешает или ограничивает доступ
        Пользователей к Connect и её инструментам, при нарушении такими лицами положений настоящего Соглашения
        осуществляет иные принадлежащие ей права.
      </li>
      <li>
        5.2. Компания вправе без возмещения каких-либо затрат или убытков Пользователю Connect заблокировать/удалить
        аккаунт Пользователя в Connect и/или приостановить, ограничить или прекратить доступ Пользователя к Connect и её
        инструментам.
      </li>
      <li>
        5.3. Компания вправе:
        <ul>
          <li>
            5.3.1. оказывать в разумные сроки техническую и информационную поддержку Пользователя, необходимую для
            работы с Connect;
          </li>
          <li>
            5.3.2. осуществлять прямые контакты с Пользователем Connect с помощью средств связи (по телефону,
            электронной почте или иными способами) в целях получения от Пользователя информации/комментариев о возникших
            проблемах/вопросах при использовании Connect, необходимых для устранения ошибок в работе Connect и их
            дальнейшего развития/совершенствования;
          </li>
          <li>
            5.3.3. приостанавливать предоставление доступа к Connect без предварительного уведомления Пользователей в
            случае необходимости проведения профилактических работ в Connect в случае наступления форс-мажорных
            обстоятельств, а также аварий или сбоев в программно-аппаратных комплексах третьих лиц или действий третьих
            лиц, направленных на приостановку или прекращение функционирования всех или части Connect.
          </li>
        </ul>
      </li>
      <li>
        5.4. При исполнении настоящего соглашения Компания в своей деятельности руководствуется требованиями применимого
        законодательства, в том числе Федерального закона Российской Федерации от 27 июля 2006 года № 149-ФЗ «Об
        информации, информационных технологиях и о защите информации».
      </li>
    </ul>
    <Typography fontWeight='bold' textTransform='uppercase'>
      6. Прекращение действия аккаунта в Connect
    </Typography>
    <ul>
      <li>
        6.1. Компания не несёт ответственности за нарушение Пользователем Connect настоящего Соглашения и оставляет за
        собой право по своему собственному усмотрению, а также при получении информации от других пользователей либо
        третьих лиц о нарушении Пользователем настоящего Соглашения заблокировать/удалить аккаунт Пользователя в Connect
        и/или таким образом приостановить, ограничить или прекратить доступ Пользователя к Connect в любое время по
        любой причине или без объяснения причин, с предварительным уведомлением или без такового, однако Компания
        приложит все возможные усилия для исключения подобных ситуаций. Приостановление, ограничение или прекращение
        доступа Пользователя к Connect, может повлечь за собой невозможность использования Connect, а также привести к
        удалению информации Пользователя, в том числе содержащейся в Connect.
      </li>
      <li>
        6.2. В частности Компания может реализовать перечисленные в п. 6.1. права по следующим причинам:
        <ul>
          <li>
            6.2.1. если Компания обнаружит в действиях Пользователя признаки нарушения условий настоящего Соглашения или
            Пользовательской документации отдельных Сервисов, в которых Пользователь был зарегистрирован;
          </li>
          <li>
            6.2.2. по соответствующему требованию органов власти и суда, если соблюдены все требования законодательства
            Российской Федерации;
          </li>
          <li>
            6.2.3. из-за создания помех и любых нарушений в отношении Connect, включая использование любых устройств,
            программного обеспечения и т. п.
          </li>
        </ul>
      </li>
    </ul>
    <Typography fontWeight='bold' textTransform='uppercase'>
      7. Гарантии и ответственность
    </Typography>
    <ul>
      <li>
        7.1. Пользователи Connect несут ответственность перед Компанией за соблюдение условий настоящего Соглашения
        Connect предоставляются на условиях «как есть» (as is). Компания не предоставляет никаких гарантий в отношении
        безошибочной и бесперебойной работы Connect, каким-либо целям и ожиданиям Пользователя, а также не предоставляет
        никаких иных гарантий, прямо не указанных в настоящем Соглашении.
      </li>
      <li>
        7.2. Компания не принимает участия в оказании Сервисами услуг и/или предоставлении ими прав использования таких
        Сервисов Пользователям Connect.
      </li>
      <li>
        7.3. Компания не принимает на себя никаких обязательств и не несёт никакой ответственности за какие-либо прямые
        или косвенные последствия какого-либо использования или невозможности использования Connect, в том числе в
        результате утраты Пользователем доступа к аккаунту в Connect, и/или ущерб, причинённый Пользователю Connect
        и/или третьим сторонам в результате какого-либо использования, неиспользования или невозможности использования
        Connect, в том числе из-за временной или постоянной утраты доступа к аккаунту в Connect по любой причине,
        возможных ошибок или сбоев в работе Connect, за исключением случаев, прямо предусмотренных законодательством
        Российской Федерации.
      </li>
      <li>
        7.4. Никакие положения настоящего Соглашения не предоставляют Пользователю право на использование фирменного
        наименования, товарных знаков, доменных имён и иных отличительных знаков Компании. Право на использование
        фирменного наименования, товарных знаков, доменных имён и иных отличительных знаков Компании может быть
        предоставлено исключительно по письменному соглашению с Компанией. Компания имеет право распоряжаться
        статистической информацией, связанной с функционированием Connect, а также информацией Пользователей Connect для
        обеспечения адресного показа рекламной информации различным аудиториям Пользователей Connect. Для целей
        организации функционирования и технической поддержки Connect и исполнения настоящего Соглашения Компания имеет
        техническую возможность доступа к аккаунтам, которую реализует только в случаях, установленных настоящим
        Соглашением.
      </li>
      <li>
        7.5. Сервисы Connect имеют право направлять Пользователю информацию о развитии Connect, их функциональности, а
        также рекламировать собственную деятельность. Пользователь Connect соглашается на получение посредством Connect
        и её инструментов электронных сообщений, SMS и иных видов рассылок информационного, в том числе
        рекламно-информационного, содержания.
      </li>
    </ul>
    <Typography fontWeight='bold' textTransform='uppercase'>
      8. Заключительные положения
    </Typography>
    <ul>
      <li>
        8.1. Признание судом какого-либо положения настоящего Соглашения недействительным, или не подлежащим
        принудительному исполнению, не влечёт недействительности или неисполнимости иных положений настоящего
        Соглашения.
      </li>
      <li>
        8.2. Настоящее Соглашение регулируется и толкуется в соответствии с законодательством Российской Федерации.
        Вопросы, не урегулированные настоящим Соглашением, подлежат разрешению в соответствии с законодательством
        Российской Федерации.
      </li>
      <li>
        8.3. Все споры сторон по настоящему Соглашению подлежат разрешению путём переписки и переговоров с
        использованием обязательного досудебного (претензионного) порядка.
      </li>
      <li>
        8.4. Обращения, предложения и претензии физических и юридических лиц к Компании в связи с настоящим Соглашением
        и всеми вопросами по функционированию Connect, нарушениями прав и интересов третьих лиц при его использовании, а
        также для запросов уполномоченных законодательством Российской Федерации лиц могут быть направлены Connect.
      </li>
    </ul>
  </Layout>
)

export default TermsOfUse
